LiuChao003/OpenART-Project/bsp/imxrt/components/micropython-nxp/extmod/moduart.c
/*
 * This file is part of the Micro Python project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2013, 2014 Damien P. George
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdio.h>
#include <string.h>
#include <stdarg.h>
#include "fsl_common.h"
#include "fsl_debug_console.h"
#include "fsl_clock.h"
#include "fsl_lpuart.h"

#include "py/nlr.h"
#include "py/runtime.h"
#include "py/stream.h"
#include "py/mperrno.h"
#include "py/mphal.h"

#include "uart.h"
#include "irq.h"
#include "genhdr/pins.h"

#include "lib/utils/interrupt_char.h"
#include "pendsv.h"

/// \moduleref pyb
/// \class UART - duplex serial communication bus
///
/// UART implements the standard UART/LPUART duplex serial communications protocol.  At
/// the physical level it consists of 2 lines: RX and TX.  The unit of communication
/// is a character (not to be confused with a string character) which can be 8 or 9
/// bits wide.
///
/// UART objects can be created and initialised using:
///
///     from pyb import UART
///
///     uart = UART(1, 115200)                         # init with given baudrate
///     uart.init(115200, bits=8, parity=None, stop=1) # init with given parameters
///
/// Bits can be 8 or 9.  Parity can be None, 0 (even) or 1 (odd).  Stop can be 1 or 2.
///
/// A UART object acts like a stream object and reading and writing is done
/// using the standard stream methods:
///
///     uart.read(10)       # read 10 characters, returns a bytes object
///     uart.read()         # read all available characters
///     uart.readline()     # read a line
///     uart.readinto(buf)  # read and store into the given buffer
///     uart.write('abc')   # write the 3 characters
///
/// Individual characters can be read/written using:
///
///     uart.readchar()     # read 1 character and returns it as an integer
///     uart.writechar(42)  # write 1 character
///
/// To check if there is anything to be read, use:
///
///     uart.any()               # returns True if any characters waiting
#define UART_CLKSRC_HZ	11059200
#define CHAR_WIDTH_8BIT (0)
#define CHAR_WIDTH_9BIT (1)
#define UART_CLOCK_SRC_SEL 0	// 0=PLLUSB1, 1=XTAL24M
typedef lpuart_handle_t UART_HandleTypeDef;
struct _pyb_uart_obj_t
{
    mp_obj_base_t base;
    LPUART_Type* pDev;
    clock_ip_name_t clk_ip_name;
    IRQn_Type irqn;
    pyb_uart_t uart_id;
    bool is_enabled;
    byte char_width;                    // 0 for 7,8 bit chars, 1 for 9 bit chars
    uint16_t char_mask;                 // 0x7f for 7 bit, 0xff for 8 bit, 0x1ff for 9 bit
    uint16_t timeout;                   // timeout waiting for first char.
    uint16_t timeout_char;              // timeout waiting between chars.
    // uint16_t read_buf_len;              // len in chars; buf can hold len-1 chars
    // volatile uint16_t read_buf_head;    // indexes first empty slot
    // uint16_t read_buf_tail;             // indexes first full slot (not full if equals head)

    lpuart_config_t config;
    // usart_handle_t uart;
    volatile uint16_t read_buf_head;    // indexes first empty slot
    uint16_t read_buf_tail;             // indexes first full slot (not full if equals head)
    byte* read_buf;                     // byte or uint16_t, depending on char size
    uint16_t read_buf_len;
};

pyb_uart_obj_t* s_pUarts[10];


#define UART_TXFIFO_FILL_CNT(p)  ((p->WATER >> 8) & 0Xff)
#define UART_RXFIFO_FILL_CNT(p) 	((p->WATER >> 24) & 0Xff)
#define UART_TXFIFO_IS_NOT_FULL(p) (UART_RXFIFO_FILL_CNT(p) < LPUART_FIFO_CAP - 1)
#define UART_RXFIFO_IS_NOT_EMPTY(p) (UART_RXFIFO_FILL_CNT(p) != 0)

#define UART_RX_IRQ_EN(p) (p->CTRL |= (1 << 21))
#define UART_RX_IRQ_DIS(p) (p->CTRL &= ~(1 << 21))


STATIC mp_obj_t pyb_uart_deinit(mp_obj_t self_in);

uint32_t _GetUartClock(void)
{
    const uint32_t constDiv = 6;

    if(CLOCK_GetMux(kCLOCK_UartMux) == 1)
        return 24 * 1024 * 1024;
    else
        return CLOCK_GetPllFreq(kCLOCK_PllUsb1) / constDiv;
}

uint32_t _ConfigUartClock(uint32_t clkSrcSel)
{
    CLOCK_SetDiv(kCLOCK_UartDiv, 1 - 1);	// to keep simple, do not use divider
    if(clkSrcSel != 0)
    {
        CLOCK_SetMux(kCLOCK_UartMux, 1);	// mux1 = XTAL24M
    }
    else
    {
        clock_usb_pll_config_t pllCfg;
        pllCfg.loopDivider = 0;	// 0=XTAL*20=480MHz , 1=*22
        CLOCK_InitUsb1Pll(&pllCfg);
        CLOCK_SetMux(kCLOCK_UartMux, 0);	// mux0 = PLLUSB1
    }
    return _GetUartClock();
}


void uart_init0(void)
{
    for(int i = 0; i < MP_ARRAY_SIZE(MP_STATE_PORT(pyb_uart_obj_all)); i++)
    {
        MP_STATE_PORT(pyb_uart_obj_all)[i] = NULL;
    }
    _ConfigUartClock(UART_CLOCK_SRC_SEL);
}

// unregister all interrupt sources
void uart_deinit(void)
{
    for(int i = 0; i < MP_ARRAY_SIZE(MP_STATE_PORT(pyb_uart_obj_all)); i++)
    {
        pyb_uart_obj_t* uart_obj = MP_STATE_PORT(pyb_uart_obj_all)[i];
        if(uart_obj != NULL)
        {
            pyb_uart_deinit(uart_obj);
        }
    }
}
#include "aia_cmm/cfg_mux_mgr.h"
STATIC bool uart_exists(int uart_id)
{
    if(uart_id > MP_ARRAY_SIZE(MP_STATE_PORT(pyb_uart_obj_all)))
    {
        // safeguard against pyb_uart_obj_all array being configured too small
        return false;
    }
    switch(uart_id)
    {

    case PYB_UART_1:
        return true;
    case PYB_UART_2:
        return true;
    case PYB_UART_3:
        return true;
    case PYB_UART_4:
        return true;
    case PYB_UART_5:
        return true;
    case PYB_UART_6:
        return true;
    default:
        return false;
    }
}

#define UART_INIT_HLP(n) \
  PYB_UART_##n: \
	UARTx = LPUART##n; \
	irqn = LPUART##n##_IRQn; \
	clk_ip_name = kCLOCK_Lpuart##n; \

// assumes Init parameters have been set up correctly
STATIC bool uart_init2(pyb_uart_obj_t* uart_obj)
{
    LPUART_Type* UARTx;
    IRQn_Type irqn;
    clock_ip_name_t clk_ip_name;

