LiuChao003/OpenART-Project/bsp/imxrt/components/micropython-nxp/extmod/moduart.c
    const pin_obj_t* pins[2]; // pins[0]: TX ; pins[1]: RX
    switch(uart_obj->uart_id)
    {
    case 1:
        UART_INIT_HLP(1);
        break;
    case 2:
        UART_INIT_HLP(2);
        break;
    case 3:
        UART_INIT_HLP(3);
        break;
    case 4:
        UART_INIT_HLP(4);
        break;
    case 5:
        UART_INIT_HLP(5);
        break;
    case 6:
        UART_INIT_HLP(6);
        break;
    default:
        // UART does not exist or is not configured for this board
        return false;
    }

    MuxItem_t mux_TXD;
    MuxItem_t mux_RXD;
    Mux_Take(uart_obj, "uart", uart_obj->uart_id, "TXD", &mux_TXD);
    mp_hal_pin_config_alt(mux_TXD.pPinObj, GPIO_MODE_OUTPUT_PP, AF_FN_LPUART);
    Mux_Take(uart_obj, "uart", uart_obj->uart_id, "RXD", &mux_RXD);
    mp_hal_pin_config_alt(mux_RXD.pPinObj, GPIO_MODE_INPUT_PUP_WEAK, AF_FN_LPUART);

    uart_obj->irqn = irqn, uart_obj->pDev = UARTx;
    uart_obj->is_enabled = 1, uart_obj->clk_ip_name = clk_ip_name, uart_obj->is_enabled = true;
    return true;
}

/* obsolete and unused
bool uart_init(pyb_uart_obj_t *uart_obj, uint32_t baudrate) {
    UART_HandleTypeDef *uh = &uart_obj->uart;
    memset(uh, 0, sizeof(*uh));
    uh->Init.BaudRate = baudrate;
    uh->Init.WordLength = UART_WORDLENGTH_8B;
    uh->Init.StopBits = UART_STOPBITS_1;
    uh->Init.Parity = UART_PARITY_NONE;
    uh->Init.Mode = UART_MODE_TX_RX;
    uh->Init.HwFlowCtl = UART_HWCONTROL_NONE;
    uh->Init.OverSampling = UART_OVERSAMPLING_16;
    return uart_init2(uart_obj);
}
*/

mp_uint_t uart_rx_any(pyb_uart_obj_t* self)
{

    int buffer_bytes = self->read_buf_head - self->read_buf_tail;
    if(buffer_bytes < 0)
    {
        return buffer_bytes + self->read_buf_len;
    }
    else if(buffer_bytes > 0)
    {
        return buffer_bytes;
    }
    else
    {
        return UART_RXFIFO_FILL_CNT(self->pDev);
    }
}

// Waits at most timeout milliseconds for at least 1 char to become ready for
// reading (from buf or for direct reading).
// Returns true if something available, false if not.
STATIC bool uart_rx_wait(pyb_uart_obj_t* self, uint32_t timeout)
{
    uint32_t start = HAL_GetTick();
    for(;;)
    {
        if(self->read_buf_tail != self->read_buf_head || UART_RXFIFO_FILL_CNT(self->pDev))
        {
            return true; // have at least 1 char ready for reading
        }
        if(HAL_GetTick() - start >= timeout)
        {
            return false; // timeout
        }
        MICROPY_EVENT_POLL_HOOK
    }
}

// assumes there is a character available
int uart_rx_char(pyb_uart_obj_t* self)
{
    if(self->read_buf_tail != self->read_buf_head)
    {
        // buffering via IRQ
        int data;
        if(self->char_width == CHAR_WIDTH_9BIT)
        {
            data = ((uint16_t*)self->read_buf)[self->read_buf_tail];
        }
        else
        {
            data = self->read_buf[self->read_buf_tail];
        }
        self->read_buf_tail = (self->read_buf_tail + 1) % self->read_buf_len;
        if(UART_RXFIFO_FILL_CNT(self->pDev))
        {
            // UART was stalled by flow ctrl: re-enable IRQ now we have room in buffer
            UART_RX_IRQ_EN(self->pDev);
        }
        return data;
    }
    else
    {
        // no buffering
        return LPUART_ReadByte(self->pDev);
    }
}

// Waits at most timeout milliseconds for TX register to become empty.
// Returns true if can write, false if can't.
STATIC bool uart_tx_wait(pyb_uart_obj_t* self, uint32_t timeout)
{
    uint32_t start = HAL_GetTick();
    for(;;)
    {
        if(UART_TXFIFO_IS_NOT_FULL(self->pDev))
        {
            return true; // tx register is empty
        }
        if(HAL_GetTick() - start >= timeout)
        {
            return false; // timeout
        }
        MICROPY_EVENT_POLL_HOOK
    }
}

#define __HAL_UART_GET_FLAG(p, flag) (LPUART_GetStatusFlags(p) & flag)

// Waits at most timeout milliseconds for UART flag to be set.
// Returns true if flag is/was set, false on timeout.
STATIC bool uart_wait_flag_set(pyb_uart_obj_t* self, uint32_t flag, uint32_t timeout)
{
    // Note: we don't use WFI to idle in this loop because UART tx doesn't generate
    // an interrupt and the flag can be set quickly if the baudrate is large.
    uint32_t start = HAL_GetTick();
    for(;;)
    {
        if(__HAL_UART_GET_FLAG(self->pDev, flag))
        {
            return true;
        }
        if(timeout == 0 || HAL_GetTick() - start >= timeout)
        {
            return false; // timeout
        }
    }
}

static bool uart_wait_for_idle(pyb_uart_obj_t* self, uint32_t timeout)
{
    uint32_t start = HAL_GetTick();
    //self->pDev->FIFO &= 1<14;
    while(1)
    {
        if(UART_RXFIFO_FILL_CNT(self->pDev) == 0)	// bug warning: this only guarantee FIFO is empty, but shiftreg may stil working!
            return true;
        if(timeout == 0 || HAL_GetTick() - start >= timeout)
        {
            return false; // timeout
        }

    }
}

// src - a pointer to the data to send (16-bit aligned for 9-bit chars)
// num_chars - number of characters to send (9-bit chars count for 2 bytes from src)
// *errcode - returns 0 for success, MP_Exxx on error
// returns the number of characters sent (valid even if there was an error)
STATIC size_t uart_tx_data(pyb_uart_obj_t* self, const void* src_in, size_t num_chars, int* errcode)
{
    if(num_chars == 0)
    {
        *errcode = 0;
        return 0;
    }

    uint32_t timeout;
    if(0)  // (self->uart.Init.HwFlowCtl & UART_HWCONTROL_CTS)
    {
        // CTS can hold off transmission for an arbitrarily long time. Apply
        // the overall timeout rather than the character timeout.
        timeout = self->timeout;
    }
    else
    {
        // The timeout specified here is for waiting for the TX data register to
        // become empty (ie between chars), as well as for the final char to be
        // completely transferred.  The default value for timeout_char is long
        // enough for 1 char, but we need to double it to wait for the last char
        // to be transferred to the data register, and then to be transmitted.
        timeout = 2 * self->timeout_char;
    }

