LiuChao003/OpenART-Project/bsp/imxrt/components/micropython-nxp/extmod/moduart.c
    const uint8_t* src = (const uint8_t*)src_in;
    size_t num_tx = 0;

    while(num_tx < num_chars)
    {
        while(!(self->pDev->STAT & (1 << 23))) {}
        uint32_t data;
        if(self->char_width == CHAR_WIDTH_9BIT)
        {
            data = *((uint16_t*)src) & 0x1ff;
            src += 2;
        }
        else
        {
            data = *src++;
        }
        self->pDev->DATA = data;
        ++num_tx;
    }
    // wait for the UART frame to complete
    if(!uart_wait_for_idle(self, timeout))
    {
        *errcode = MP_ETIMEDOUT;
        return num_tx;
    }

    *errcode = 0;
    return num_tx;
}

STATIC void uart_tx_char(pyb_uart_obj_t* uart_obj, int c)
{
    uint16_t ch = c;
    int errcode;
    uart_tx_data(uart_obj, &ch, 1, &errcode);
}

void uart_tx_strn(pyb_uart_obj_t* uart_obj, const char* str, uint len)
{
    int errcode;
    uart_tx_data(uart_obj, str, len, &errcode);
}

void uart_tx_strn_cooked(pyb_uart_obj_t* uart_obj, const char* str, uint len)
{
    for(const char* top = str + len; str < top; str++)
    {
        if(*str == '\n')
        {
            uart_tx_char(uart_obj, '\r');
        }
        uart_tx_char(uart_obj, *str);
    }
}

// this IRQ handler is set up to handle RXNE interrupts only
void uart_irq_handler(void* base, void* pCtx)
{
    // get the uart object
    pyb_uart_obj_t* self = (pyb_uart_obj_t*)pCtx;
    LPUART_Type* pDev = (LPUART_Type*) base;
    if(self == NULL)
    {
        // UART object has not been set, so we can't do anything, not
        // even disable the IRQ.  This should never happen.
        return;
    }
    uint8_t rxCnt = (pDev->WATER >> 24) & 7;
    int data;
    // clear all possible error flags
    LPUART_ClearStatusFlags(pDev,
                            kLPUART_RxOverrunFlag | kLPUART_NoiseErrorFlag | kLPUART_FramingErrorFlag | kLPUART_ParityErrorFlag);
    while(rxCnt--)
    {
        data = LPUART_ReadByte(pDev);
#ifdef repl_uart_id
        if(self->uart_id == repl_uart_id && mp_interrupt_char != -1 && data == mp_interrupt_char)
        {
            pendsv_kbd_intr();
            // return;
        }
#endif
        if(self->read_buf_len != 0)
        {
            uint16_t next_head = (self->read_buf_head + 1) % self->read_buf_len;
            if(next_head != self->read_buf_tail)
            {
                if(self->char_width == CHAR_WIDTH_9BIT)
                {
                    ((uint16_t*)self->read_buf)[self->read_buf_head] = data;
                }
                else
                {
                    self->read_buf[self->read_buf_head] = data;
                }
                self->read_buf_head = next_head;
            }
            else     // No room: leave char in buf, disable interrupt
            {
                UART_RX_IRQ_DIS(self->pDev);
            }
        }

    }
}

#define LPUART_IRQHANDLER_ENTRY(n) \
void LPUART##n##_IRQHandler(void) { \
	uart_irq_handler(LPUART##n, s_pUarts[n]); \
}

LPUART_IRQHANDLER_ENTRY(1)
LPUART_IRQHANDLER_ENTRY(2)
LPUART_IRQHANDLER_ENTRY(3)
LPUART_IRQHANDLER_ENTRY(4)
LPUART_IRQHANDLER_ENTRY(5)
LPUART_IRQHANDLER_ENTRY(6)
LPUART_IRQHANDLER_ENTRY(7)
LPUART_IRQHANDLER_ENTRY(8)

/******************************************************************************/
/* Micro Python bindings                                                      */

STATIC void pyb_uart_print(const mp_print_t* print, mp_obj_t self_in, mp_print_kind_t kind)
{
    pyb_uart_obj_t* self = self_in;
    if(!self->is_enabled)
    {
        mp_printf(print, "UART(%u)", self->uart_id);
    }
    else
    {
        mp_int_t bits = (self->config.dataBitsCount == kLPUART_SevenDataBits ? 7 : 8);

        mp_printf(print, "UART(%u, baudrate=%u, bits=%u, parity=",
                  self->uart_id, self->config.baudRate_Bps, bits);
        if(self->config.parityMode == kLPUART_ParityDisabled)
        {
            mp_print_str(print, "None");
        }
        else if(self->config.parityMode == kLPUART_ParityEven)
        {
            mp_print_str(print, "Even");
        }
        else
            mp_print_str(print, "Odd");
        /*
        if (self->Init.HwFlowCtl) {
            mp_printf(print, ", flow=");
            if (self->Init.HwFlowCtl & UART_HWCONTROL_RTS) {
                mp_printf(print, "RTS%s", self->Init.HwFlowCtl & UART_HWCONTROL_CTS ? "|" : "");
            }
            if (self->Init.HwFlowCtl & UART_HWCONTROL_CTS) {
                mp_printf(print, "CTS");
            }
        }
        */
        mp_printf(print, ", stop=%u, timeout=%u, timeout_char=%u, read_buf_len=%u)",
                  self->config.stopBitCount == kLPUART_OneStopBit ? 1 : 2,
                  self->timeout, self->timeout_char,
                  self->read_buf_len == 0 ? 0 : self->read_buf_len - 1); // -1 to adjust for usable length of buffer
    }
}

/// \method init(baudrate, bits=8, parity=None, stop=1, *, timeout=1000, timeout_char=0, flow=0, read_buf_len=64)
///
/// Initialise the UART bus with the given parameters:
///
///   - `baudrate` is the clock rate.
///   - `bits` is the number of bits per byte, 7, 8 or 9.
///   - `parity` is the parity, `None`, 0 (even) or 1 (odd).
///   - `stop` is the number of stop bits, 1 or 2.
///   - `timeout` is the timeout in milliseconds to wait for the first character.
///   - `timeout_char` is the timeout in milliseconds to wait between characters.
///   - `flow` is RTS | CTS where RTS == 256, CTS == 512
///   - `read_buf_len` is the character length of the read buffer (0 to disable).

typedef struct _uart_init_helper_param
{
    mp_arg_val_t baudrate, bits, parity, stop, flow, timeout, timeout_char, read_buf_len;
} uart_init_helper_param_t;


STATIC mp_obj_t pyb_uart_init_helper(pyb_uart_obj_t* self, mp_uint_t n_args, const mp_obj_t* pos_args, mp_map_t* kw_args)
{
    static const mp_arg_t allowed_args[] =
    {
        { MP_QSTR_baudrate, MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 9600} },
        { MP_QSTR_bits, MP_ARG_INT, {.u_int = 8} },
        { MP_QSTR_parity, MP_ARG_OBJ, {.u_obj = mp_const_none} },
        { MP_QSTR_stop, MP_ARG_INT, {.u_int = 1} },
        { MP_QSTR_flow, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_timeout, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 1000} },
        { MP_QSTR_timeout_char, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_read_buf_len, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 64} },
    };

    // parse args
    uart_init_helper_param_t args;
    mp_arg_parse_all(n_args, pos_args, kw_args,
                     MP_ARRAY_SIZE(allowed_args), allowed_args, (mp_arg_val_t*)&args);

    // set the UART configuration values
    lpuart_config_t* init = &self->config;

    // baudrate
    LPUART_GetDefaultConfig(init);
    init->baudRate_Bps = args.baudrate.u_int;
    init->enableRx = init->enableTx = true;

