LiuChao003/OpenART-Project/bsp/imxrt/components/micropython-nxp/extmod/moduart.c
    // parity
    mp_int_t bits = args.bits.u_int;
    if(args.parity.u_obj == mp_const_none)
    {
        init->parityMode = kLPUART_ParityDisabled;
    }
    else
    {
        mp_int_t parity = mp_obj_get_int(args.parity.u_obj);
        init->parityMode = (parity & 1) ? kLPUART_ParityOdd : kLPUART_ParityEven;
        // bits += 1; // STs convention has bits including parity
    }

    // number of bits
    if(bits == 7)
    {
        init->dataBitsCount = kLPUART_SevenDataBits;
    }
    else if(bits == 8)
    {
        init->dataBitsCount = kLPUART_EightDataBits;
    }
    else
    {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError, "unsupported combination of bits and parity"));
    }

    // stop bits
    switch(args.stop.u_int)
    {
    case 1:
        init->stopBitCount = kLPUART_OneStopBit;
        break;
    default:
        init->stopBitCount = kLPUART_TwoStopBit;
        break;
    }

    // >>> not supported in current SDK
    // // flow control
    // init->HwFlowCtl = args.flow.u_int;

    // extra config (not yet configurable)
    // init->Mode = UART_MODE_TX_RX;
    // init->OverSampling = UART_OVERSAMPLING_16;
    // <<<

    // init UART (if it fails, it's because the port doesn't exist)
    if(!uart_init2(self))
    {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError, "UART(%d) does not exist", self->uart_id));
    }
    s_pUarts[self->uart_id] = self;
    // set timeout
    self->timeout = args.timeout.u_int;

    // set timeout_char
    // make sure it is at least as long as a whole character (13 bits to be safe)
    // minimum value is 2ms because sys-tick has a resolution of only 1ms
    self->timeout_char = args.timeout_char.u_int;
    uint32_t min_timeout_char = 13000 / init->baudRate_Bps + 2;
    if(self->timeout_char < min_timeout_char)
    {
        self->timeout_char = min_timeout_char;
    }

    // setup the read buffer

    if(init->dataBitsCount == kLPUART_SevenDataBits)
    {
        self->char_mask = 0x7F;
        self->char_width = 0;
    }
    else
    {
        if(init->dataBitsCount == kLPUART_EightDataBits)
        {
            self->char_mask = 0xFF;
            self->char_width = 0;
        }
    }

    m_del(byte, self->read_buf, self->read_buf_len << self->char_width);
    self->read_buf_head = 0;
    self->read_buf_tail = 0;
    if(args.read_buf_len.u_int <= 0)
    {
        // no read buffer, blocking mode
        self->read_buf_len = 0;
        self->read_buf = NULL;
        NVIC_DisableIRQ(self->irqn);
        LPUART_DisableInterrupts(self->pDev, (uint32_t) -1L);
    }
    else
    {
        if(args.read_buf_len.u_int < 8)
            self->read_buf_len = 8;
        else
            self->read_buf_len = args.read_buf_len.u_int;
        self->read_buf = m_new(byte, self->read_buf_len << self->char_width);
        uint32_t clk = _GetUartClock();
        status_t ret = LPUART_Init(self->pDev, &self->config, clk);
        if(ret != kStatus_Success)
        {
            nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError, "set baudrate %d is not possible", args.baudrate.u_int));
        }
        HAL_NVIC_SetPriority(self->irqn, IRQ_PRI_UART, IRQ_SUBPRI_UART);
        UART_RX_IRQ_EN(self->pDev);
        NVIC_EnableIRQ(self->irqn);
    }

    return mp_const_none;
}

/// \classmethod \constructor(bus, ...)
///
/// Construct a UART object on the given bus.  `bus` can be 0-9
/// With no additional parameters, the UART object is created but not
/// initialised (it has the settings from the last initialisation of
/// the bus, if any).  If extra arguments are given, the bus is initialised.
/// See `init` for parameters of initialisation.
///
/// The physical pins of the UART busses are:
///
///   - `UART(4)` is on `XA`: `(TX, RX) = (X1, X2) = (PA0, PA1)`
///   - `UART(1)` is on `XB`: `(TX, RX) = (X9, X10) = (PB6, PB7)`
///   - `UART(6)` is on `YA`: `(TX, RX) = (Y1, Y2) = (PC6, PC7)`
///   - `UART(3)` is on `YB`: `(TX, RX) = (Y9, Y10) = (PB10, PB11)`
///   - `UART(2)` is on: `(TX, RX) = (X3, X4) = (PA2, PA3)`
STATIC mp_obj_t pyb_uart_make_new(const mp_obj_type_t* type, size_t n_args, size_t n_kw, const mp_obj_t* args)
{
    // check arguments
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    // work out port
    int uart_id = mp_obj_get_int(args[0]);
        if(!uart_exists(uart_id))
        {
            nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError, "UART(%d) does not exist", uart_id));
        }
    pyb_uart_obj_t* self;
    if(MP_STATE_PORT(pyb_uart_obj_all)[uart_id] == NULL)
    {
        // create new UART object
        self = m_new0(pyb_uart_obj_t, 1);
        self->base.type = &pyb_uart_type;
        self->uart_id = uart_id;
        MP_STATE_PORT(pyb_uart_obj_all)[uart_id] = self;
    }
    else
    {
        // reference existing UART object
        self = MP_STATE_PORT(pyb_uart_obj_all)[uart_id];
    }

    if(n_args > 1 || n_kw > 0)
    {
        // start the peripheral
        mp_map_t kw_args;
        mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
        pyb_uart_init_helper(self, n_args - 1, args + 1, &kw_args);
    }

    return self;
}

STATIC mp_obj_t pyb_uart_init(mp_uint_t n_args, const mp_obj_t* args, mp_map_t* kw_args)
{
    return pyb_uart_init_helper(args[0], n_args - 1, args + 1, kw_args);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(pyb_uart_init_obj, 1, pyb_uart_init);

/// \method deinit()
/// Turn off the UART bus.
STATIC mp_obj_t pyb_uart_deinit(mp_obj_t self_in)
{
    pyb_uart_obj_t* self = self_in;
    self->is_enabled = false;
    LPUART_Deinit(self->pDev);
    NVIC_DisableIRQ(self->irqn);
    CLOCK_DisableClock(self->clk_ip_name);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pyb_uart_deinit_obj, pyb_uart_deinit);

/// \method any()
/// Return `True` if any characters waiting, else `False`.
STATIC mp_obj_t pyb_uart_any(mp_obj_t self_in)
{
    pyb_uart_obj_t* self = self_in;
    return MP_OBJ_NEW_SMALL_INT(uart_rx_any(self));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pyb_uart_any_obj, pyb_uart_any);

/// \method writechar(char)
/// Write a single character on the bus.  `char` is an integer to write.
/// Return value: `None`.
STATIC mp_obj_t pyb_uart_writechar(mp_obj_t self_in, mp_obj_t char_in)
{
    pyb_uart_obj_t* self = self_in;

    // get the character to write (might be 9 bits)
    uint16_t data = mp_obj_get_int(char_in);

    // write the character
    int errcode;
    if(uart_tx_wait(self, self->timeout))
    {
        uart_tx_data(self, &data, 1, &errcode);
    }
    else
    {
        errcode = MP_ETIMEDOUT;
    }

    if(errcode != 0)
    {
        mp_raise_OSError(errcode);
    }

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(pyb_uart_writechar_obj, pyb_uart_writechar);

