LiuChao003/OpenART-Project/bsp/imxrt/components/micropython-nxp/extmod/moduart.c
/// \method readchar()
/// Receive a single character on the bus.
/// Return value: The character read, as an integer.  Returns -1 on timeout.
STATIC mp_obj_t pyb_uart_readchar(mp_obj_t self_in)
{
    pyb_uart_obj_t* self = self_in;
    if(uart_rx_wait(self, self->timeout))
    {
        return MP_OBJ_NEW_SMALL_INT(uart_rx_char(self));
    }
    else
    {
        // return -1 on timeout
        return MP_OBJ_NEW_SMALL_INT(-1);
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pyb_uart_readchar_obj, pyb_uart_readchar);

// uart.sendbreak()
STATIC mp_obj_t pyb_uart_sendbreak(mp_obj_t self_in)
{
    pyb_uart_obj_t* self = self_in;
    self = self;
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pyb_uart_sendbreak_obj, pyb_uart_sendbreak);

STATIC const mp_rom_map_elem_t pyb_uart_locals_dict_table[] =
{
    // instance methods

    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&pyb_uart_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&pyb_uart_deinit_obj) },
    { MP_ROM_QSTR(MP_QSTR_any), MP_ROM_PTR(&pyb_uart_any_obj) },

    /// \method read([nbytes])
    { MP_ROM_QSTR(MP_QSTR_read), MP_ROM_PTR(&mp_stream_read_obj) },
    /// \method readline()
    { MP_ROM_QSTR(MP_QSTR_readline), MP_ROM_PTR(&mp_stream_unbuffered_readline_obj)},
    /// \method readinto(buf[, nbytes])
    { MP_ROM_QSTR(MP_QSTR_readinto), MP_ROM_PTR(&mp_stream_readinto_obj) },
    /// \method write(buf)
    { MP_ROM_QSTR(MP_QSTR_write), MP_ROM_PTR(&mp_stream_write_obj) },

    { MP_ROM_QSTR(MP_QSTR_writechar), MP_ROM_PTR(&pyb_uart_writechar_obj) },
    { MP_ROM_QSTR(MP_QSTR_readchar), MP_ROM_PTR(&pyb_uart_readchar_obj) },
    { MP_ROM_QSTR(MP_QSTR_sendbreak), MP_ROM_PTR(&pyb_uart_sendbreak_obj) },

    // class constants
    // { MP_ROM_QSTR(MP_QSTR_RTS), MP_ROM_INT(UART_HWCONTROL_RTS) },
    // { MP_ROM_QSTR(MP_QSTR_CTS), MP_ROM_INT(UART_HWCONTROL_CTS) },
};

STATIC MP_DEFINE_CONST_DICT(pyb_uart_locals_dict, pyb_uart_locals_dict_table);

STATIC mp_uint_t pyb_uart_read(mp_obj_t self_in, void* buf_in, mp_uint_t size, int* errcode)
{
    pyb_uart_obj_t* self = self_in;
    byte* buf = buf_in;

    // check that size is a multiple of character width
    if(size & self->char_width)
    {
        *errcode = MP_EIO;
        return MP_STREAM_ERROR;
    }

    // convert byte size to char size
    size >>= self->char_width;

    // make sure we want at least 1 char
    if(size == 0)
    {
        return 0;
    }

    // wait for first char to become available
    if(!uart_rx_wait(self, self->timeout))
    {
        // return EAGAIN error to indicate non-blocking (then read() method returns None)
        *errcode = MP_EAGAIN;
        return MP_STREAM_ERROR;
    }

    // read the data
    byte* orig_buf = buf;
    for(;;)
    {
        int data = uart_rx_char(self);
        if(self->char_width == CHAR_WIDTH_9BIT)
        {
            *(uint16_t*)buf = data;
            buf += 2;
        }
        else
        {
            *buf++ = data;
        }
        if(--size == 0 || !uart_rx_wait(self, self->timeout_char))
        {
            // return number of bytes read
            return buf - orig_buf;
        }
    }
}

STATIC mp_uint_t pyb_uart_write(mp_obj_t self_in, const void* buf_in, mp_uint_t size, int* errcode)
{
    pyb_uart_obj_t* self = self_in;
    const byte* buf = buf_in;

    // check that size is a multiple of character width
    if(size & self->char_width)
    {
        *errcode = MP_EIO;
        return MP_STREAM_ERROR;
    }

    // wait to be able to write the first character. EAGAIN causes write to return None
    if(!uart_tx_wait(self, self->timeout))
    {
        *errcode = MP_EAGAIN;
        return MP_STREAM_ERROR;
    }

    // write the data
    size_t num_tx = uart_tx_data(self, buf, size >> self->char_width, errcode);
    if(*errcode == 0 || *errcode == MP_ETIMEDOUT)
    {
        // return number of bytes written, even if there was a timeout
        return num_tx << self->char_width;
    }
    else
    {
        return MP_STREAM_ERROR;
    }
}

STATIC mp_uint_t pyb_uart_ioctl(mp_obj_t self_in, mp_uint_t request, mp_uint_t arg, int* errcode)
{
    pyb_uart_obj_t* self = self_in;
    mp_uint_t ret;
    if(request == MP_STREAM_POLL)
    {
        mp_uint_t flags = arg;
        ret = 0;
        if((flags & MP_STREAM_POLL_RD) && uart_rx_any(self))
        {
            ret |= MP_STREAM_POLL_RD;
        }
        if((flags & MP_STREAM_POLL_WR) && UART_TXFIFO_FILL_CNT(self->pDev))
        {
            ret |= MP_STREAM_POLL_WR;	// set whenever UART TXFIFO is not full
        }
    }
    else
    {
        *errcode = MP_EINVAL;
        ret = MP_STREAM_ERROR;
    }
    return ret;
}

STATIC const mp_stream_p_t uart_stream_p =
{
    .read = pyb_uart_read,
    .write = pyb_uart_write,
    .ioctl = pyb_uart_ioctl,
    .is_text = false,
};

const mp_obj_type_t pyb_uart_type =
{
    { &mp_type_type },
    .name = MP_QSTR_UART,
    .print = pyb_uart_print,
    .make_new = pyb_uart_make_new,
    .getiter = mp_identity_getiter,
    .iternext = mp_stream_unbuffered_iter,
    .protocol = &uart_stream_p,
    .locals_dict = (mp_obj_dict_t*)& pyb_uart_locals_dict,
};
